[
    "... that total amount of Bitcoin is limited ? It's limited just like gold or oil, total of all possible Bitcoins is 21 milion, it's estimated that we will reach final one somewhere around February 2140",
    "... that no one knows who created Bitcoin ? No one actually knows exact person. People refer to the potential creator as Satoshi Nakamoto",
    "... that there are over 7,300 different cryptocurrencies ?",
    "... that some of the names of cryptocurrencies are very creative ? For example : PizzaCoin, Cabbage, VodkaCoin, Jesus Coin, Dogecoin, Coinye (just like Kanye)",
    "... that China is the biggest cryptocurrency miner ? China controls around 60-75% of the mining network depending on the source",
    "... that first commercial Bitcoin transaction was for pizza ? On 22 May, 2010 a man in Florida paid 10,000 Bitcoin for two pizzas. At the time 10,000 Bitcoins were worth 40$, today (December 2021) the same amount is worth 491 billion $",
    "... that some cryptos like Ethereum have more uses then as a coin ? Ethereum for example is also used to execute smart contracts and can be used for supply chain management",
    "... that Ethereum fees are called \"gas\" ? Gas represents the computational effort used to complete the transaction",
    "... that they're games based on blockchain ? First one was CryptoKitties and one CryptoKitty once was sold for 600ETH !",
    "... that Dogecoin started as a joke ? Creators of Dogecoin invented the token around the image of surprised-looking Shiba Inu dog as a meme. Today there's serious money in Dogecoin",
    "... around 20% of Bitcoin has been lost forever ? If you lost your private key, there's no way back",
    "... that imaginary creator of Bitcoin Satoshi Nakamoto, according to Decrypt, has 1.1 million BTC ? apparently there is a deal that he won't ever touch those",
    "... that there have been 668 million Bitcoin transactions since it's launch ?",
    "... that there are almost 100,000 Bitcoin millionaires at this moment",
    "... that anyone can create their own crypto coin ?",
    "... life is worth of living ? If bitcoin crashed and you lost your life's work and willingness to live check suicidepreventionlifeline.org",
    "... that cryptocurrencies markets are open 24/7 as opposed to stocks ? For example New York Stock Exchange is open only from 9:30am to 4:00pm. Cryptos are for real sigma's who grind all the time"
]